# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitCommandId..::..Name Property
RevitCommandId Class See Also
---
The command name.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
RevitCommandId Class
Autodesk.Revit.UI Namespace